
; 0 Black   4 Red          8 Dark Grey     c Light Red
; 1 Blue    5 Magenta      9 Light Blue    d Light Magenta
; 2 Green   6 Brown        a Light Green   e Light Brown
; 3 Cyan    7 Light Grey   b Light Cyan    f – White
; пример:
;     02h (зелёный текст на чёрном фоне)
;     f0h (чёрный текст на белом фоне)

; resb - резервирование байтов
; [] - получить значение
; $al - ссылка на идентификатор 
; $ вычисляет позицию начала строки
; $$ определяет начало текущей секции (сегмента)

; H L X - Registers
; S - Segments
; P I - Pointers
;      +----+----+----+----+----+----+
;      |  8 бит  |       16 бит      |
;      +----+----+----+----+----+----+
;      |  H |  L |  X |  S |  P |  I |
; +----+----+----+----+----+----+----+
; | A  | AH | AL | AX |    |    |    |
; +----+----+----+----+----+----+----+
; | B  | BH | BL | BX |    | BP |    |
; +----+----+----+----+----+----+----+
; | C  | CH | CL | CX | CS |    |    |
; +----+----+----+----+----+----+----+
; | D  | DH | DL | DX | DS |    | DI |
; +----+----+----+----+----+----+----+
; | E  |    |    |    | ES |    |    |
; +----+----+----+----+----+----+----+
; | F  |    |    |    | FS |    |    |
; +----+----+----+----+----+----+----+
; | G  |    |    |    | GS |    |    |
; +----+----+----+----+----+----+----+
; | S  |    |    |    | SS | SP | SI |
; +----+----+----+----+----+----+----+

[BITS 16]
[ORG 7c00h]

times 510 - ($ - $$) db 0 
db 0x55, 0xAA